{
  "title": "Legal Information",
  "content": "<section>\n  <h2>Legal Information for the Awaiting Christ Return App</h2>\n\n  <h3>1. Privacy Policy</h3>\n  <p>We value your privacy. This app does not collect, store, or share any personal information by default.</p>\n  <p>However, when you voluntarily submit a <strong>prayer request</strong>, you may choose to include your <strong>email address</strong>. This email is used solely for the purpose of acknowledging your request or responding to you, if necessary. We do not sell, share, or distribute your email address to any third parties.</p>\n  <p>All prayer request data is handled with confidentiality and care, and may be cleared periodically as part of app maintenance. We do not require login, account creation, or any form of personal data to access the app’s core features.</p>\n\n  <h3>2. Terms of Use</h3>\n  <p>By using the Awaiting Christ Return app, you agree to the following:</p>\n  <ul>\n    <li>You will use the app for personal, non-commercial, spiritual growth.</li>\n    <li>You will not copy, resell, or distribute the content without proper permission.</li>\n    <li>You acknowledge that content is provided “as-is” and may contain links or teachings from external sources.</li>\n    <li>We are not liable for any direct or indirect damages arising from the improper use of this app, or misinterpretation of its content.</li>\n    <li>This app is not intended for children under 13 without parental guidance.</li>\n  </ul>\n\n  <h3>3. Copyright and Content Attribution</h3>\n  <p>Most content in this app — including devotionals, news, and articles — is created or curated by <strong>Awaiting Christ Return Ministry</strong>.</p>\n  <p>However, we may feature <strong>select sermons or teachings</strong> from respected Bible teachers and ministries whose work we value and believe aligns with biblical truth. Such content is clearly marked or attributed where applicable. If any content owners would like their material removed or credited differently, they may contact us directly via the app or at our provided ministry email.</p>\n  <p>All Bible verses are used under public domain or appropriate license where required.</p>\n\n  <h3>4. Spiritual Disclaimer</h3>\n  <p>The content within this app is meant for <strong>spiritual encouragement and biblical instruction</strong> only. It is <strong>not</strong> a substitute for professional legal, psychological, medical, or financial advice.</p>\n  <p>Users are encouraged to seek appropriate help from licensed professionals where necessary. The teachings and interpretations presented reflect the ministry’s convictions and understanding of Scripture.</p>\n\n  <h3>5. Your Consent</h3>\n  <p>By using this app, you consent to this Legal Notice, including the Privacy Policy and Terms of Use.</p>\n  <p>We may update this policy from time to time.</p>\n\n  <p><em>© 2025 Awaiting Christ Return. All rights reserved.<br>Developed and curated by Emmanuel Essien.</em></p>\n</section>"
}
