{
  "id": "rapture_sermon_058",
  "type": "rapture",
  "page": 4,
  "title": "Your Choice, Your Eternity: Embracing Free Will",
  "thumbnailUrl": "https://raw.githubusercontent.com/Essien-max/await-christ-app-content/main/image%20%2868%29.webp",
  "content": "<style>:root { --text-color: #333; --heading-color: #2c3e50; --subheading-color: #34495e; --background-color: #fff; } [data-theme='dark'] { --text-color: #e0e0e0; --heading-color: #ecf0f1; --subheading-color: #bdc3c7; --background-color: #1a1a1a; } @media (prefers-color-scheme: dark) { :root:not([data-theme='light']) { --text-color: #e0e0e0; --heading-color: #ecf0f1; --subheading-color: #bdc3c7; --background-color: #1a1a1a; } }</style><article style=\"font-family: Arial, sans-serif; line-height: 1.6; color: var(--text-color); max-width: 800px; margin: 0 auto; padding: 20px; background-color: var(--background-color);\">\n  <h1 style=\"font-size: 24px; color: var(--heading-color); text-align: center; margin-bottom: 20px;\">Your Choice, Your Eternity: The Power of Free Will</h1>\n  <p style=\"margin-bottom: 15px;\">Ever wondered if you have a say in your eternal destiny? The Bible’s answer is a resounding yes. Salvation isn’t a cosmic coin toss or a divine draft where God picks favorites; it’s an open invitation to choose life, love, and eternity with Him. Your free will is the key, and God’s grace is the door. Let’s explore how your choice shapes your forever, blending God’s sovereign call with the power He’s given you to decide.</p>\n  <h2 style=\"font-size: 20px; color: var(--subheading-color); margin-top: 20px;\">The Divine Invitation</h2>\n  <p style=\"margin-bottom: 15px;\">The Bible paints a beautiful picture of salvation as a divine dance. John 6:44 says God draws us to Himself, like a loving parent calling a child home. Yet, Romans 10:13 adds the crucial counterpart: “Everyone who calls on the name of the Lord will be saved.” This isn’t a one-sided affair where you’re dragged into eternity unwillingly. God’s grace invites, but you get to RSVP. Your choice to trust Jesus is what seals your eternal security.</p>\n  <h2 style=\"font-size: 20px; color: var(--subheading-color); margin-top: 20px;\">Free Will in Action</h2>\n  <p style=\"margin-bottom: 15px;\">The idea of free will can spark theological debates, but the Bible keeps it simple. God doesn’t force salvation on anyone, nor does He lock the door to a select few. 1 Timothy 2:4 reveals His heart: He desires all people to be saved and come to the knowledge of the truth. Your ability to choose is a gift, not a burden. It’s like standing before a beautifully wrapped present—God offers salvation, but you decide whether to unwrap it.</p>\n  <h2 style=\"font-size: 20px; color: var(--subheading-color); margin-top: 20px;\">The Weight of Your Choice</h2>\n  <p style=\"margin-bottom: 15px;\">Your freedom to choose comes with eternal stakes. John 3:18 is clear: those who believe in Jesus are not condemned, but those who reject Him choose a path apart from God. This isn’t about God being harsh—it’s about the reality of turning away from the source of life. Saying “no” to Jesus doesn’t just mean missing out on heaven; it means choosing an eternity without His presence. The power of your decision shapes your forever.</p>\n  <h2 style=\"font-size: 20px; color: var(--subheading-color); margin-top: 20px;\">Grace and Responsibility</h2>\n  <p style=\"margin-bottom: 15px;\">The balance of God’s grace and your responsibility is at the heart of salvation. Ephesians 2:8–9 reminds us that salvation is a gift, received through faith, not earned through works. Yet, faith requires action—choosing to trust Jesus, to surrender your life to Him. It’s like accepting an invitation to a grand feast—you don’t earn the meal, but you have to walk through the door. God’s grace makes the way, but your choice takes you there.</p>\n  <h2 style=\"font-size: 20px; color: var(--subheading-color); margin-top: 20px;\">Why Choosing Feels Hard</h2>\n  <p style=\"margin-bottom: 15px;\">Let’s be real: choosing Jesus isn’t always easy. It means letting go of pride, control, or the comfort of living on your own terms. Doubts, distractions, or the pull of the world can make faith feel like a leap into the unknown. But the Bible assures us that God meets us in our weakness. Romans 5:8 declares that Christ died for us while we were still sinners—proof that His love doesn’t wait for you to be perfect. Your choice to trust Him opens the door to eternal life.</p>\n  <h2 style=\"font-size: 20px; color: var(--subheading-color); margin-top: 20px;\">Eternal Security Through Choice</h2>\n  <p style=\"margin-bottom: 15px;\">Once you choose Jesus, your eternity is secure. John 10:28–29 promises that no one can snatch a believer from God’s hand. This assurance isn’t a free pass to live recklessly but a foundation to live purposefully. Knowing your salvation is sealed empowers you to love boldly, serve faithfully, and share the gospel with urgency. It’s like having a ticket to an eternal destination—your choice locks it in, and God’s faithfulness keeps it safe.</p>\n  <h2 style=\"font-size: 20px; color: var(--subheading-color); margin-top: 20px;\">A Call to Decide</h2>\n  <p style=\"margin-bottom: 15px;\">Your life is a moment to make a choice that echoes into eternity. God’s invitation is on the table, wrapped in the sacrifice of Jesus. Will you accept it, trusting Him as your Savior? Or will you hesitate, risking a forever apart from Him? The Bible’s message is clear: salvation is for everyone who chooses to believe. Don’t wait for a perfect moment—today is the day. Say “yes” to Jesus, and step into an eternity where your choice becomes your greatest victory.</p>\n</article>",
  "version": "0",
  "category": "Eternal Security"
}