{
  "id": "rapture_sermon_075",
  "type": "rapture",
  "page": 5,
  "title": "The Three Tenses of Salvation: Past, Present, Future—A Divine Tapestry of Grace",
  "thumbnailUrl": "https://raw.githubusercontent.com/Essien-max/await-christ-app-content/refs/heads/main/Salvation75.webp",
  "content": "<style>:root { --text-color: #333; --heading-color: #2c3e50; --subheading-color: #34495e; --background-color: #fff; } [data-theme='dark'] { --text-color: #e0e0e0; --heading-color: #ecf0f1; --subheading-color: #bdc3c7; --background-color: #1a1a1a; } @media (prefers-color-scheme: dark) { :root:not([data-theme='light']) { --text-color: #e0e0e0; --heading-color: #ecf0f1; --subheading-color: #bdc3c7; --background-color: #1a1a1a; } }</style><article style=\"font-family: Arial, sans-serif; line-height: 1.6; color: var(--text-color); max-width: 800px; margin: 0 auto; padding: 20px; background-color: var(--background-color);\">\n  <h1 style=\"font-size: 24px; color: var(--heading-color); text-align: center; margin-bottom: 20px;\">The Three Tenses of Salvation: Past, Present, Future—A Divine Tapestry of Grace</h1>\n  <p style=\"margin-bottom: 15px;\">What if salvation wasn’t a single moment but a glorious journey woven through time, redeeming your past, shaping your present, and securing your heavenly future? It’s awe-inspiring: could God’s plan for your soul unfold like a sacred trilogy, transforming you from sinner to saint across eternity’s timeline? Join this thrilling exploration of salvation’s three tenses, where God’s grace paints a masterpiece of redemption!</p>\n  <h2 style=\"font-size: 20px; color: var(--subheading-color); margin-top: 20px;\">Justification: Freed from Sin’s Penalty</h2>\n  <p style=\"margin-bottom: 15px;\">Dr. Andy Woods’ insights unveil this divine framework with clarity that stirs the soul. First, the past tense: justification. The moment you trust Christ, God declares you righteous, like a heavenly judge pronouncing, “Forgiven!” (Romans 5:1). Christ’s righteousness becomes yours (Philippians 3:9), erasing sin’s penalty in an instant. It’s as if a captive’s chains are shattered, setting them free to walk in God’s light!</p>\n  <h2 style=\"font-size: 20px; color: var(--subheading-color); margin-top: 20px;\">Sanctification: Growing in Christ’s Likeness</h2>\n  <p style=\"margin-bottom: 15px;\">Next comes the present tense: sanctification, a daily adventure of becoming more like Jesus. It’s not instant perfection—oh, the humorous stumbles we all make!—but a steady walk, fueled by Scripture, prayer, and the fellowship of believers (Philippians 2:12). Paul urges, “Work out your salvation,” like a gardener tending a growing vine, nurturing it toward fruitfulness (2 Corinthians 3:18). Think of it as a joyful apprenticeship, where each step molds you closer to Christ’s image.</p>\n  <h2 style=\"font-size: 20px; color: var(--subheading-color); margin-top: 20px;\">Glorification: The Promise of Eternal Redemption</h2>\n  <p style=\"margin-bottom: 15px;\">Finally, the future tense: glorification, the grand crescendo of God’s plan! At death or Christ’s return, sin’s presence vanishes entirely (Romans 8:23). You’re fully redeemed, body and soul, shining in Christ’s likeness (Philippians 1:23). It’s the ultimate homecoming, fulfilling Romans 8:30’s golden promise: called, justified, glorified. This is the moment when every believer steps into eternity’s glory, forever free!</p>\n  <h2 style=\"font-size: 20px; color: var(--subheading-color); margin-top: 20px;\">The Divine Tapestry of Grace</h2>\n  <p style=\"margin-bottom: 15px;\">These three tenses weave a divine story: freed from sin’s penalty, delivered from its power, and soon released from its presence. Dr. Woods illustrates this through Abraham, who believed God’s promise (past), grew in faith through trials (present), and awaits resurrection’s glory (future). Picture a seed: planted in faith (justified), sprouting through growth (sanctified), and blooming into eternal beauty (glorified). It’s delightful to see our own “sprouting” struggles as part of God’s perfect plan!</p>\n  <p style=\"margin-bottom: 15px;\">Why this divine structure? It reflects God’s heart: complete redemption, no half-measures. In a world chasing quick fixes, salvation’s process is a patient, joyful journey, like savoring a feast course by course. Stories bring it to life—a believer finds strength in sanctification’s daily growth, pressing on despite setbacks. Or a dying saint, clinging to the hope of glorification, faces eternity with peace. These testimonies make salvation not just theology but a living, breathing reality.</p>\n  <h2 style=\"font-size: 20px; color: var(--subheading-color); margin-top: 20px;\">Living in the Assurance of God’s Plan</h2>\n  <p style=\"margin-bottom: 15px;\">This framework empowers us. Justification’s assurance fuels courage for sanctification’s challenges, while glorification’s promise anchors hope. It’s like a divine tapestry, each thread—past, present, future—woven by God’s grace into a masterpiece of redemption. The joy comes in knowing God oversees every stage, ensuring no believer is left unfinished (Philippians 1:6). Even our missteps, like Peter’s denials, become part of the journey toward holiness.</p>\n  <p style=\"margin-bottom: 15px;\">In a world of fleeting promises, this truth stands unshakable. Salvation’s three tenses remind us that God’s work in us is eternal, comprehensive, and deeply personal. It’s not about earning His favor but resting in His finished work, growing in His love, and awaiting His glory. This perspective transforms daily life—every prayer, every act of kindness, every moment of trust becomes a step toward eternity.</p>\n  <h2 style=\"font-size: 20px; color: var(--subheading-color); margin-top: 20px;\">Embrace the Journey of Grace</h2>\n  <p style=\"margin-bottom: 15px;\">O child of grace, receive this beautiful exhortation: Rest in justification’s freedom, pursue sanctification’s growth, and await glorification’s glory! Let God’s plan shape your life. Step into His story today—eternity beckons with open arms. Live boldly, and shine for His kingdom!</p>\n</article>",
  "version": "0",
  "category": "Salvation"
}