{
  "title": "Statement of Faith",
  "content": "<section>\n  <h2>Statement of Faith</h2>\n\n  <article>\n    <h3>1. The Nature of God</h3>\n    <p>There is one God, creator of all things. He is perfect, infinite, and eternal in all His ways. He exists in three separate, but equal, Persons: the Father, the Son, and the Holy Spirit.</p>\n    <p><strong>Scripture:</strong> Deut. 6:4; Gen. 1:1; John 6:27; Heb. 1:8; Acts 5:3,4; 2 Cor. 13:14</p>\n  </article>\n\n  <article>\n    <h3>2. Jesus Christ</h3>\n    <p>Jesus Christ is true God and true Man. He was conceived of the Holy Spirit and born of the Virgin Mary. He lived a sinless life, died on the cross, was buried, and arose on the third day. He later ascended into Heaven where He is presently seated at the right hand of God the Father as our High Priest and Advocate.</p>\n    <p><strong>Scripture:</strong> John 1:1; Phil. 2:5-8; Luke 1:30-35; 2 Cor. 5:21; 1 Cor. 15:3,4; Heb. 7:25; 1 John 2:1</p>\n  </article>\n\n  <article>\n    <h3>3. Salvation by Grace through Faith</h3>\n    <p>God has provided the remedy for our disobedience by sending His Son, Jesus Christ, to be the sacrifice for our sins. We receive forgiveness not through any religious deeds or good works, but only by personal faith in Jesus Christ. Those who receive Him as Savior are born of the Spirit and assured of eternity in Heaven.</p>\n    <p><strong>Scripture:</strong> Romans 5:6-9; Romans 4:5; Ephesians 2:8,9; John 3:5-18</p>\n  </article>\n\n  <article>\n    <h3>4. The Church</h3>\n    <p>The “true Church,” which began at Pentecost, is composed of all who through faith in Jesus Christ have been united in one body, with Christ as the head. Each local church—such as Sugar Land Bible Church—is a physical body of believers manifesting the true Church to the world. The local church is autonomous under Christ’s authority and Scripture’s guidance.</p>\n    <p><strong>Scripture:</strong> Matt. 16:18; Acts 1:5; 2:41,42; 1 Cor. 12:13; Eph. 4:15; 1 Cor. 1:2; Acts 14:23; Acts 20:28; Heb. 13:7,17</p>\n  </article>\n\n  <article>\n    <h3>5. The Ordinances</h3>\n    <p>Water baptism and the Lord’s Supper are the only ordinances given to believers. Baptism follows conversion as a public declaration of identification with Christ. The Lord’s Supper is regularly observed as a memorial of Christ’s sacrificial death. Neither is a means of salvation.</p>\n    <p><strong>Scripture:</strong> Acts 10:47,48; 1 Cor. 11:26</p>\n  </article>\n\n  <article>\n    <h3>6. The Return of Christ</h3>\n    <p>Believers live with the constant hope and expectation of the imminent return of Jesus Christ—first for His saints, then returning with His saints.</p>\n    <p><strong>Scripture:</strong> John 14:1-3; Titus 2:11-14; 1 Thess. 4:13-18</p>\n  </article>\n\n  <article>\n    <h3>7. Resurrection and Judgment</h3>\n    <p>Everyone, after death, will be resurrected—believers to everlasting life in Heaven, unbelievers to judgment and everlasting, conscious punishment in Hell.</p>\n    <p><strong>Scripture:</strong> John 5:28,29; Rev. 20:11-15</p>\n  </article>\n\n  <article>\n    <h3>8. Christian Living</h3>\n    <p>As believers in Jesus Christ, we are commanded to love God, love one another, and love unbelievers. Loving God is shown through obedience to His Word; loving fellow believers through service; loving unbelievers through friendship and sharing the gospel both personally and through missions.</p>\n    <p><strong>Scripture:</strong> Mark 12:28-31; John 14:15; Phil. 2:1-5; Luke 19:10; Matt. 28:19-20</p>\n  </article>\n</section>"
}
